{
  "title": "Flaky All-Butter Pie Dough",
  "source": {
    "title": "Dessert Person",
    "author": "Claire Saffitz"
  },
  "time": {
    "active": {
      "amount": 1,
      "unit": "h"
    },
    "passive": {
      "amount": 3,
      "unit": "h"
    }
  },
  "servings": {
    "amount": 1,
    "unit": "9-inch Pie Crust"
  },
  "date": [31, 12, 2023],
  "tags": ["Dessert", "Baking", "Ingredient"],
  "ingredients": [
    {
      "title": null,
      "notes": null,
      "contents": [
        {
          "name": "Unsalted Butter",
          "amount": 10,
          "unit": "tbsp",
          "note": "chilled"
        },
        {
          "name": "All Purpose Flour",
          "amount": { "n": 3, "d": 2 },
          "unit": "c",
          "note": "plus more for rolling out"
        },
        {
          "name": "Sugar",
          "amount": 1,
          "unit": "tbsp"
        },
        {
          "name": "Salt",
          "amount": { "n": 3, "d": 4 },
          "unit": "tsp",
          "note": "diamond crystal kosher"
        }
      ]
    }
  ],
  "directions": [
    {
      "title": "Preparing the dough",
      "steps": [
        "Fill a 1-cup liquid measure with ice water and refrigerate it while you assemple the pie dough. Cut a 5 tablespoon block of the butter crosswise into ⅛ in thick slices and refrigerate.",
        "In a large bowl, whisk togethre the flour, sugar, and the salt to combine.",
        {
          "step": "Cut the remaining 5 tablespoons butter into ½ in cubes and toss in the flour mixture to coat. Quickly and firmly use your fingertips to smash the butter pieces into the flour, flattening them and working into smaller bits until the largest pieces are no bigger than a pea. Remove the butter slices from the refrigerator, add them to the flour mixture, toss to coat, then flatten between your thumbs and fingertips into thin sheets, letting them break apart if that's what they want to do. Once you've worked in all the butter, you should have a very coarse, slightly yellowed mixture filled with some larger pieces of butter and some very small bits.",
          "note": "Work quickly while you're smashing the butter into the flour so it stays cold; if it starts to soften, place the whole bowl in the freezer to chill for several minutes."
        },
        "Slowly drizzle 5 tablespoons of the ice water (avoiding any ice) into the mixture, tossing constantly with a fork to incorporate. Switch to your hands and toss the mixture several times until shaggy pieces of dough form, then knead the mixture inside the boal a few times to bring it together (the dough will look very clumpy and dry, with loose bits). Line the work surface with a sheet of plastic wrap, then transfer any large clumps of dough to the plastic. Tossing again with the fork, drizzle more ice water 1 teaspoon at a time into the bowl with the remaining flour mixture until only a few dry spots remain, then knead with your hands to bring it together into a dough. Transfer the last bits of dough to the plastic wrap.",
        "Pat the dough into a ¾in thick square or rectangle. Wrap tightly in the plastic, pressing out any air, and press down on the dough with the heel of your hand to flatten it further and force it into the corners of the plastic. Refrigerate for 2 hours. The pie dough is technically ready to use at this point, but proceed throough the next step, which will make it extra flaky.",
        {
          "step": "Let the dough sit on the counter for 5 minutes to soften slightly. Unwrap it and place on a lightly floured surface. Unwrap it and place on a lightly floured surface. Use a rolling pin to beat the dough all across the surface to make it more pliable. Dust the top and underside of the dough with more flour, then roll it out, dusting with more flour as needed, into a rectangle that's about three times longer than it is wide and between ¼ and ½ in thick. Fold the dough in thirds like a letter (this makes more butter layers, which create a flaky texture), then wrap tightly in plastic, Refrigerate the dough until it's relaxed, at least 30 minutes and up to 3 days. It's now ready to use. If the recipe calls for a lined pie plate, a parbaked crust, or a fully baked crust, follow the directions below.",
          "note": "If you try to roll out the dough straight from the refrigerator, it will likely crack. However, if tempered dough cracks while rolling, it might be underhydrated. Dribble 2 teaspoons of cold water across the surface, or spritz it a couple of times with water using a spray bottle, then fold the dough in half, wrap it in plastic, and refrigerate for 30 minutes. This should make it easier to roll out. "
        }
      ]
    },
    {
      "title": "Forming the Crust",
      "steps": [
        "Let the pie dough sit at room temperature for about 5 minutes to soften slightly, then beat it across the surface again with a rolling pin to make it more pliable. Dust the top and underside of the dough with mroe flour as needed, into a 13in round that's about ⅛ in thick. Roll the pastry onto the rolling pin.",
        {
          "step": "Unroll the round onto a 9 in pie plate, preferably glass, letting the pastry slump gently down the sides into the bottom. Firmly press the pastry into the bottom and up the sides of the plate, ensuring contact everywhere and taking care not to stretch it.",
          "note": "Press the dough firmly and thoroughly inot the pie plate or pan with your palms and fingertips, and firmly anchor the edges to the lip of the pie plate. This will help prevent shrinkage in the oven and encourage better browning."
        },
        "Use scissors to trim around the edge of the pastry, leaving a ½ in overhang (discard the scraps).",
        "Tuck the overhang underneath itself all the way around so you have a lip of double-thick pastry resting just around the rim of the pie plate.",
        "Press down firmly around the rim to seal, then crimp the crust all the way around, using the thumb of one hand and the thumb and forefinger of the other, flouring your fingers if needed to prevent sticking. Instead of a crimp, you can also use the tines of a fork to create hash marks around the rim."
      ]
    },
    {
      "title": "Baking the Crust",
      "steps": [
        "Arrange an oven rack in the center position and preheat the oven to 425 F. Line a rimmed baking sheet with foil and set aside.",
        {
          "step": "Freeze the lined pie plate until the dough is very firm, about 10 minutes, then prick the bottom of the pastry in several places with a fork to prevent the crust from puffing up. Line the inside of the pie plate with two pieces of foil, arranged perpendicularly, so the overhand of the foil completely covers the edge of the crust. Fill the pie plate with pie weights, dried beans, or rice and place on the prepared baking sheet. Bake in the center of the oven until the edge of the crust is set and starting to turn golden when you peek under the foil, 25 to 30 minutes. Remove the plate from the oven and carefully lift the foil and pie weights out of the crust. Reduce the oven temperature to 350°F.",
          "note": "Don't forget to reduce the oven temperature from 425°F to 350°F when baking the crust again after removing the pie weights. Baking a second time at a lower temperature helps prevent cracking and shrinkage, which could cause problems later on (especially if the pie has a liquidy filling)."
        },
        "Return the pan to the oven and bake until the crust is golden brown all over, another 20 to 25 minutes for a parbaked crust, or until deep golden brown all over, 10 to 15 minutes longer, for a fully baked crust. Set the crust aside to cool."
      ]
    }
  ],
  "notes": [
    {
      "title": "Do Ahead",
      "content": "The dough wrapped tightly in plastic and refrigerated, will keep up to 3 days or can be frozen up to 2 months (place in a resealable plastic bag before freezing). Let the frozen dough thaw overnight before using. The par- or fully baked crust, covered and stored at room temperature, will keep for 1 day."
    },
    {
      "title": "Almond Pie Dough",
      "content": "Replace ⅓ cupe of the all-purpose flour, with ⅓ cup almond flour. Note that the dough will require less ice water to come together because the almond flour is much less absorbent than all-purpose. "
    },
    {
      "title": "Whole-grain Pie Dough",
      "content": "Replace ⅓ cup of the all-purpose flour with ⅓ cup of any whole-grain flour such as wheat, spelt, rye, or buckwheat, and follow the recipe instructions. Note that whole-grain flour absorbs more water than all-purpose, so you will need slightly more ice water to bring the dough together. Expect this version to be ever so slightly desner and crumblier than the original."
    },
    {
      "title": "Double Crust",
      "content": "For a double-crust pie, double all the ingredients. Cut half the butter crosswise into ⅛ in thick slices and then cut the rest into ½ in cubes. Start by adding ½ cup ice water to the bowl and proceed with the method as written to bring the dough together. Wrap the entire amount of dough in plastic, forming it into a squarel, and refrigerate. Cut the square of dough in half to create two single crusts and proceed with the rolling and folding method for each one."
    }
  ]
}
